tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "dteoh/sqa"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Fast, simple and clean video downloader
brew "annie"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Shell extension to jump to frequently used directories
brew "autojump"
# Top-like interface for container metrics
brew "ctop"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Move files and folders to the trash
brew "macos-trash"
# Java-based project management
brew "maven"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Simplified and community-driven man pages
brew "tldr"
# C++ Library Manager
brew "vcpkg"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Android SDK component
cask "android-platform-tools"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "slowquitapps"

