tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "dteoh/sqa"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "annie"
brew "python@3.9"
brew "autojump"
brew "bat"
brew "cmake"
brew "exa"
brew "fd"
brew "fileicon"
brew "fzf"
brew "gh"
brew "go"
brew "gradle"
brew "hstr"
brew "htop"
brew "icdiff"
brew "kotlin"
brew "macos-trash"
brew "maven"
brew "mycli"
brew "neovim"
brew "node"
brew "pipx"
brew "ripgrep"
brew "screenfetch"
brew "wget"
cask "adoptopenjdk8"
cask "android-platform-tools"
cask "slowquitapps"
